[
  {
    "Id": 1,
    "Front": "DSGVO Grundsätze",
    "Back": "Rechtmäßigkeit, Zweckbindung, Datenminimierung, Richtigkeit der Daten, Speicherbegrenzung, Integrität und Vertraulichkeit, Rechenschaftspflicht, ",
    "Category": "Rechtswissen DSGVO"
  },
  {
    "Id": 2,
    "Front": "Leasingvertrag",
    "Back": "Mietähnlicher Vertrag über die Nutzung eines Wirtschaftsguts gegen regelmäßige Zahlungen. Eigentum bleibt beim Leasinggeber.",
    "Category": "Vertragsrecht, Finanzwesen"
  },
  {
    "Id": 3,
    "Front": "Fälligkeitsdarlehen",
    "Back": "Darlehen, bei dem die gesamte Rückzahlung erst am Ende der Laufzeit erfolgt. Währenddessen nur Zinszahlungen.",
    "Category": "Finanzwesen"
  },
  {
    "Id": 4,
    "Front": "Vertragsautonomie",
    "Back": "Freiheit der Vertragsparteien, Inhalt, Form und Partner eines Vertrags selbst zu bestimmen. Einschränkungen durch Gesetze möglich.",
    "Category": "Rechtswissen"
  },
  {
    "Id": 5,
    "Front": "Instandhaltungspflicht",
    "Back": "Verpflichtung, eine Sache in gebrauchsfähigem Zustand zu erhalten. Trägt meist der Eigentümer oder Vermieter.",
    "Category": "Rechtswissen"
  },
  {
    "Id": 6,
    "Front": "Subventionen",
    "Back": "Subventionen sind finanzielle Zuschüsse oder Unterstützungszahlungen, die von Regierungen oder öffentlichen Institutionen an Unternehmen, Organisationen oder Einzelpersonen gewährt werden. Ziel ist es, bestimmte wirtschaftliche Aktivitäten zu fördern, wie etwa die Produktion von Gütern oder Dienstleistungen, die von gesellschaftlichem Interesse sind. Subventionen können in Form von direkten Zahlungen, Steuererleichterungen oder zinsgünstigen Krediten gewährt werden. Sie werden oft genutzt, um die Preise für Verbraucher zu senken, Arbeitsplätze zu schaffen oder umweltfreundliche Technologien zu unterstützen.",
    "Category": "Finanzwesen"
  },
  {
    "Id": 7,
    "Front": "Ratendarlehen",
    "Back": "sind Darlehen, bei denen der Kreditnehmer das geliehene Kapital in regelmäßigen, meist monatlichen Raten zurückzahlt. Jede Rate setzt sich dabei aus einem Zinsanteil und einem Tilgungsanteil zusammen. Zu Beginn sind die Zinsen höher, da sie auf den gesamten Darlehensbetrag berechnet werden, aber mit fortschreitender Rückzahlung sinkt der Zinsanteil und der Tilgungsanteil wird größer. Ratendarlehen sind eine gängige Finanzierungsform für Privatpersonen, zum Beispiel für den Kauf von Autos oder Konsumgütern, aber auch für größere Investitionen.",
    "Category": "Finanzwesen"
  },
  {
    "Id": 8,
    "Front": "Underpinning Contract",
    "Back": "Ein Underpinning Contract ist ein Vertrag, der die Grundlage für eine Hauptvereinbarung bildet und zusätzliche rechtliche Rahmenbedingungen oder Absicherungen für das zugrunde liegende Geschäft festlegt.",
    "Category": "Vertragsrecht"
  },
  {
    "Id": 9,
    "Front": "Intervall",
    "Back": "Ein Intervall ist der Zeitraum oder die Entfernung zwischen zwei Ereignissen oder Punkten. In der Mathematik bezeichnet es einen Abschnitt auf einer Zahlengerade, der durch zwei Grenzwerte begrenzt wird.",
    "Category": "Allgemeinwissen"
  },
  {
    "Id": 10,
    "Front": "Anlagevermögen",
    "Back": "Anlagevermögen umfasst langfristige Vermögenswerte eines Unternehmens, die für die betriebliche Tätigkeit genutzt werden und nicht für den kurzfristigen Verkauf bestimmt sind. Dazu gehören z. B. Grundstücke, Gebäude, Maschinen und Fahrzeuge.",
    "Category": "Finanzwesen"
  },
  {
    "Id": 11,
    "Front": "Unternehmensbilanzen",
    "Back": "Unternehmensbilanzen sind finanzielle Übersichten, die die Vermögens- und Kapitalstruktur eines Unternehmens zu einem bestimmten Zeitpunkt darstellen. Sie setzen sich aus der Aktiva (Vermögenswerte) und der Passiva (Eigen- und Fremdkapital) zusammen und geben Aufschluss über die finanzielle Lage des Unternehmens.",
    "Category": "Finanzwesen"
  },
  {
    "Id": 12,
    "Front": "File.Exists()",
    "Back": "Die Methode File.Exists() in C# wird verwendet, um zu überprüfen, ob eine Datei im angegebenen Pfad existiert. Sie gibt einen booleschen Wert zurück-",
    "Category": "Coding Csharp"
  },
  {
    "Id": 13,
    "Front": "XAML",
    "Back": "XAML steht für Extensible Application Markup Language und ist eine deklarative Markup-Sprache, die verwendet wird, um Benutzeroberflächen zu erstellen. Sie wird hauptsächlich in .NET-Technologien wie WPF, UWP und Xamarin eingesetzt. Mit XAML definieren Entwickler das Layout und die Struktur einer Anwendung, während die Logik normalerweise in einer Programmiersprache wie C# geschrieben wird.",
    "Category": "Coding Csharp"
  },
  {
    "Id": 14,
    "Front": "WPF",
    "Back": "WPF, was für Windows Presentation Foundation steht, ist ein UI-Framework von Microsoft, das für die Entwicklung von Desktop-Anwendungen unter Windows verwendet wird. Es bietet eine leistungsstarke Umgebung zur Erstellung grafisch anspruchsvoller Benutzeroberflächen, einschließlich 2D- und 3D-Grafiken sowie Animationen und Datenbindung. WPF nutzt XAML für das Design und C# für die Anwendungslogik.",
    "Category": "Coding Csharp"
  },
  {
    "Id": 15,
    "Front": "UWP",
    "Back": "die Universal Windows Platform, ist eine Plattform von Microsoft, die es Entwicklern ermöglicht, Anwendungen zu erstellen, die auf allen Windows 10 Geräten laufen, wie PCs, Tablets, Smartphones und sogar Xbox. UWP verwendet ebenfalls XAML für das UI-Design und ermöglicht den Zugriff auf moderne Windows 10 Funktionen wie Cortana und Live-Tiles, während die Apps im Microsoft Store bereitgestellt werden.",
    "Category": "Coding Csharp"
  },
  {
    "Id": 16,
    "Front": "XAML",
    "Back": "XAML steht für Extensible Application Markup Language und ist eine deklarative Markup-Sprache, die verwendet wird, um Benutzeroberflächen zu erstellen. Sie wird hauptsächlich in .NET-Technologien wie WPF, UWP und Xamarin eingesetzt. Mit XAML definieren Entwickler das Layout und die Struktur einer Anwendung, während die Logik normalerweise in einer Programmiersprache wie C# geschrieben wird.",
    "Category": "Coding Csharp"
  },
  {
    "Id": 17,
    "Front": "test",
    "Back": "ye",
    "Category": "wer"
  },
  {
    "Id": 18,
    "Front": "new card ",
    "Back": "yo",
    "Category": "xoxo"
  },
  {
    "Id": 19,
    "Front": "Maschinencode",
    "Back": "Maschinencode ist die direkt von der CPU ausführbare Form eines Programms. Er besteht aus binären Anweisungen (0 und 1), die spezifische Operationen wie Rechnen, Speichern oder Vergleichen steuern. Da Maschinencode schwer zu lesen und zu schreiben ist, wird er meist durch höhere Programmiersprachen erstellt und dann von einem Compiler in Maschinencode übersetzt.",
    "Category": "Allgemeinwissen"
  },
  {
    "Id": 20,
    "Front": "GPL ",
    "Back": "GPL (GNU General Public License) ist eine Open-Source-Lizenz, die von der Free Software Foundation entwickelt wurde. Sie erlaubt die freie Nutzung, Veränderung und Weitergabe von Software, solange der Quellcode offen bleibt und Änderungen ebenfalls unter der GPL veröffentlicht werden. Dies fördert Transparenz, Zusammenarbeit und verhindert proprietäre Nutzung ohne Freigabe des Codes.",
    "Category": "Informatik"
  },
  {
    "Id": 21,
    "Front": "MIT-Lizenz",
    "Back": "MIT-Lizenz ist eine sehr permissive Open-Source-Lizenz, die es erlaubt, Software frei zu nutzen, zu verändern und zu verbreiten, auch für kommerzielle Zwecke. Die einzige Bedingung ist, dass der ursprüngliche Lizenztext erhalten bleibt. Sie bietet Entwicklern maximale Freiheit und wird oft in Open-Source-Projekten verwendet.",
    "Category": "Informatik"
  },
  {
    "Id": 22,
    "Front": "ITIL",
    "Back": "ITIL (Information Technology Infrastructure Library) ist ein Framework für IT-Service-Management (ITSM). Es bietet Best Practices zur Planung, Bereitstellung und Verwaltung von IT-Diensten, um Geschäftsprozesse effizient zu unterstützen. ITIL hilft Unternehmen, ihre IT-Services kundenorientiert und wirtschaftlich zu optimieren.",
    "Category": "Frameworks "
  },
  {
    "Id": 23,
    "Front": "Design Patterns",
    "Back": "Entwurfsmuster (Design Patterns) sind bewährte Lösungen für wiederkehrende Probleme in der Softwareentwicklung. Sie bieten strukturierte Ansätze zur Verbesserung von Code-Wartbarkeit, Flexibilität und Wiederverwendbarkeit. Bekannte Muster sind z. B. Singleton, Factory und Observer.",
    "Category": "Coding"
  },
  {
    "Id": 24,
    "Front": "SSH",
    "Back": "SSH (Secure Shell) ist ein Netzwerkprotokoll für die sichere Kommunikation zwischen Computern. Es ermöglicht verschlüsselte Verbindungen für Remote-Zugriff, Dateiübertragungen und sichere Befehlsausführung. SSH wird häufig für die Administration von Servern und sicheren Datenaustausch genutzt.",
    "Category": "Netzwerke"
  },
  {
    "Id": 25,
    "Front": "RTU",
    "Back": "RTU (Remote Terminal Unit) ist ein elektronisches Gerät, das in Industrie- und Automatisierungssystemen zur Fernüberwachung und -steuerung eingesetzt wird. Es sammelt Daten von Sensoren, verarbeitet sie und sendet sie an ein zentrales Leitsystem (SCADA). RTUs werden häufig in der Energieversorgung, Wasserwirtschaft und Prozessindustrie genutzt.",
    "Category": "Informatik"
  },
  {
    "Id": 26,
    "Front": "OSI-Model",
    "Back": "Das 7-Schichten-OSI-Modell beschreibt, wie Daten in Netzwerken übertragen werden. Anwendungsschicht (Application Layer), Darstellungsschicht (Presentation Layer), Sitzungsschicht (Session Layer), Transportschicht (Transport Layer),Vermittlungsschicht (Network Layer),Sicherungsschicht (Data Link Layer), Bitübertragungsschicht (Physical Layer)",
    "Category": "Netzwerke"
  },
  {
    "Id": 27,
    "Front": "Encapsulation (Kapselung) in Netzwerken",
    "Back": "Encapsulation (Kapselung) in Netzwerken bezieht sich auf den Prozess, bei dem Daten in verschiedene Schichten eines Netzwerkprotokolls verpackt werden. Jede Schicht fügt der ursprünglichen Nachricht ihre eigene Informationsheader hinzu, um die Kommunikation und Übertragung zu steuern. Beim Senden von Daten durch ein Netzwerk werden diese Schichten in der Reihenfolge von der Anwendung bis zur physischen Übertragung hinzugefügt und auf der Empfangsseite wieder \u0022abgewickelt\u0022, wobei die jeweiligen Header entfernt werden. Dieser Prozess gewährleistet eine strukturierte, sichere und effiziente Datenübertragung.",
    "Category": "Netzwerke"
  },
  {
    "Id": 28,
    "Front": "Oszilloskop",
    "Back": "Ein Oszilloskop ist ein elektronisches Messgerät, das die Spannung über die Zeit graphisch darstellt. Es zeigt elektrische Signale als Wellenformen auf einem Bildschirm, sodass Ingenieure und Techniker Signalverläufe, Frequenzen und andere Eigenschaften von elektrischen Schaltungen überwachen können. Oszilloskope werden in der Fehlerdiagnose, Signalverarbeitung und Entwicklung von elektronischen Geräten verwendet.",
    "Category": "Allgemeinwissen"
  },
  {
    "Id": 29,
    "Front": "Operational Level Agreement (OLA)",
    "Back": "Ein Operational Level Agreement (OLA) ist eine Vereinbarung innerhalb eines Unternehmens, die die Serviceleistungen zwischen verschiedenen internen Abteilungen oder Teams regelt. Es beschreibt die spezifischen Leistungen, die ein Team gegenüber einem anderen erbringen muss, und legt die Anforderungen in Bezug auf Qualität, Verfügbarkeit und Reaktionszeiten fest. Im Gegensatz zu einem SLA (Service Level Agreement), das sich auf externe Kunden bezieht, konzentriert sich das OLA auf die internen Abläufe und die Zusammenarbeit zwischen verschiedenen Abteilungen.",
    "Category": "Verträge"
  },
  {
    "Id": 30,
    "Front": "SLA (Service Level Agreement) = Extern: Vereinbarung zwischen einem Unternehmen und externen Dienstleistern oder Kunden.",
    "Back": "Ja, ein Service Level Agreement (SLA) ist oft auch eine Vereinbarung zwischen einem Unternehmen und einem Outsourcer (z. B. einem externen Dienstleister). In diesem Kontext regelt die SLA die spezifischen Leistungen, die der Outsourcer erbringen muss, einschließlich der Qualitätsstandards, Reaktionszeiten, Verfügbarkeiten und anderer Servicekriterien. Es stellt sicher, dass der Outsourcer die vereinbarten Dienstleistungen auf einem akzeptablen Niveau bereitstellt und gibt dem Unternehmen klare Erwartungen an die Zusammenarbeit.",
    "Category": "Vertäge"
  },
  {
    "Id": 31,
    "Front": "Underpinning Contract (UC)",
    "Back": "Ein SLA ist oft Teil des Underpinning Contracts, da es die Servicelevels festlegt, die der Vertragspartner (z. B. ein Outsourcing-Dienstleister) liefern muss.",
    "Category": "Verträge"
  },
  {
    "Id": 32,
    "Front": "Öffnungsklauseln",
    "Back": "Öffnungsklauseln sind vertragliche Bestimmungen, die es den Parteien ermöglichen, bestimmte Vertragsbedingungen während der Laufzeit des Vertrages anzupassen. Diese Klauseln werden oft verwendet, um auf unvorhergesehene Veränderungen in den Umständen zu reagieren, wie z. B. Preisänderungen, Änderungen in gesetzlichen Vorschriften oder Marktbedingungen. Sie bieten Flexibilität, um den Vertrag an veränderte Gegebenheiten anzupassen, ohne dass der gesamte Vertrag neu verhandelt werden muss.",
    "Category": "Verträge"
  },
  {
    "Id": 33,
    "Front": "Rechtsordnung",
    "Back": "Ein Oberbegriff für Strafrecht, Zivilrecht und Öffentliches Recht ist Rechtsordnung oder einfach Recht. Diese drei Bereiche bilden zusammen das gesamte Rechtssystem eines Staates und regeln unterschiedliche Aspekte der rechtlichen Beziehungen und Verantwortlichkeiten innerhalb der Gesellschaft.",
    "Category": "Rechte"
  },
  {
    "Id": 34,
    "Front": "DIN",
    "Back": "DIN (Deutsches Institut für Normung) ist eine Organisation, die in Deutschland Normen und Standards für verschiedene Branchen und Technologien entwickelt. Diese Normen dienen dazu, Qualität, Sicherheit und Effizienz in Produkten, Dienstleistungen und Prozessen zu gewährleisten. DIN-Normen sind in vielen Bereichen wie Maschinenbau, Elektrotechnik, Bauwesen und auch im IT-Bereich weit verbreitet.",
    "Category": "Rechte"
  },
  {
    "Id": 35,
    "Front": "OPC",
    "Back": "Open Platform Communications (OPC), oft auch als OPC Classic bezeichnet, ist ein Kommunikationsstandard, der ursprünglich von Microsoft entwickelt wurde, um den Datenaustausch zwischen verschiedenen Automatisierungs- und Steuerungssystemen in der Industrie zu ermöglichen. Der Standard verwendet COM/DCOM (Component Object Model / Distributed Component Object Model), um eine Plattform-unabhängige Kommunikation zwischen Geräten und Anwendungen sicherzustellen.",
    "Category": "Rechte"
  },
  {
    "Id": 36,
    "Front": "Audit",
    "Back": "Ein Audit ist eine systematische, unabhängige Überprüfung von Prozessen, Systemen oder Finanzunterlagen, um deren Genauigkeit, Wirksamkeit und Übereinstimmung mit festgelegten Standards oder Vorschriften zu bewerten. Audits können in verschiedenen Bereichen durchgeführt werden, wie z. B. im Finanzwesen, der IT-Sicherheit oder der Qualitätssicherung. Ziel ist es, Schwachstellen aufzudecken, die Einhaltung von Vorschriften sicherzustellen und Empfehlungen zur Verbesserung zu geben.",
    "Category": "BWL"
  },
  {
    "Id": 37,
    "Front": "ISO",
    "Back": "ISO (International Organization for Standardization) ist eine internationale Organisation, die weltweit anerkannte Normen für verschiedene Branchen und Sektoren entwickelt. ISO-Normen legen Standards für Qualität, Sicherheit, Effizienz und Nachhaltigkeit fest, um Produkte, Dienstleistungen und Systeme zu harmonisieren und die Zusammenarbeit zwischen Ländern zu fördern. Bekannte ISO-Normen sind zum Beispiel die ISO 9001 für Qualitätsmanagement und die ISO 27001 für Informationssicherheitsmanagement.",
    "Category": "Informatik"
  },
  {
    "Id": 38,
    "Front": "TCO",
    "Back": "TCO (Total Cost of Ownership) bezeichnet die Gesamtkosten, die mit dem Erwerb, Betrieb und der Wartung eines Produkts oder Systems über dessen gesamten Lebenszyklus hinweg verbunden sind. Dies schließt nicht nur den Anschaffungspreis ein, sondern auch Kosten für Installation, Schulung, Wartung, Support, Energieverbrauch und eventuell entstehende Reparaturen. Die TCO-Analyse hilft Unternehmen, eine fundierte Entscheidung über Investitionen zu treffen, indem sie die langfristigen Kosten berücksichtigt.",
    "Category": ""
  },
  {
    "Id": 39,
    "Front": "EU-Ecolabel",
    "Back": "Das EU-Ecolabel ist ein Umweltzeichen der Europäischen Union, das umweltfreundliche Produkte und Dienstleistungen kennzeichnet. Es wird an Produkte verliehen, die hohe Umweltstandards erfüllen und während ihres Lebenszyklus eine geringe Auswirkung auf die Umwelt haben, z. B. in Bezug auf Energieverbrauch, Schadstoffemissionen und Abfallmanagement. Das EU-Ecolabel dient Verbrauchern als Orientierungshilfe, um umweltbewusste Kaufentscheidungen zu treffen und fördert die nachhaltige Entwicklung.",
    "Category": "Allgemeinwissen"
  },
  {
    "Id": 40,
    "Front": "GPP (Green Public Procurement)",
    "Back": "GPP (Green Public Procurement), auf Deutsch Grüne öffentliche Beschaffung, bezeichnet die Praxis, bei der öffentliche Auftraggeber Produkte, Dienstleistungen und Bauprojekte auswählen, die umweltfreundlicher und nachhaltiger sind. Ziel ist es, durch die Berücksichtigung von Umweltkriterien bei der Vergabe von Aufträgen die Umweltauswirkungen zu verringern und zur Förderung einer umweltfreundlicheren Wirtschaft beizutragen. GPP berücksichtigt Faktoren wie Energieeffizienz, Ressourcenschonung und reduzierte Schadstoffemissionen.",
    "Category": "Allgemeinwissen"
  },
  {
    "Id": 41,
    "Front": "Governance",
    "Back": "Governance bezeichnet die Struktur, Prozesse und Prinzipien, durch die Organisationen oder Systeme geführt, kontrolliert und verwaltet werden. Es umfasst die Entscheidungsfindung, Verantwortlichkeiten, Rechenschaftspflicht und die Einhaltung von Vorschriften. In der Unternehmensführung bezieht sich Governance auf die Art und Weise, wie ein Unternehmen oder eine Organisation ihre Ziele erreicht, Risiken managt und die Interessen der Stakeholder berücksichtigt. Gute Governance fördert Transparenz, Effizienz und ethisches Verhalten in allen Bereichen der Organisation.",
    "Category": ""
  },
  {
    "Id": 42,
    "Front": "Compliance",
    "Back": "Compliance bezeichnet die Einhaltung von Gesetzen, Vorschriften, Richtlinien und internen Standards innerhalb einer Organisation. Es umfasst alle Maßnahmen und Verfahren, die sicherstellen, dass ein Unternehmen oder eine Institution rechtlichen und regulatorischen Anforderungen entspricht. Compliance ist in vielen Bereichen wichtig, darunter Finanzen, Datenschutz und Umweltvorschriften, und schützt Unternehmen vor rechtlichen Konsequenzen, Reputationsverlust und anderen Risiken.",
    "Category": ""
  },
  {
    "Id": 43,
    "Front": "GRC ",
    "Back": "GRC (Governance, Risk Management, and Compliance) bezeichnet einen integrierten Ansatz zur Verwaltung von Unternehmensführung, Risikomanagement und Compliance.",
    "Category": ""
  },
  {
    "Id": 44,
    "Front": "Risikoobjektivismus",
    "Back": "Risikoobjektivismus besagt, dass Risiken objektiv messbar und universell definierbar sind, unabhängig von subjektiven Wahrnehmungen. Risiken können durch Daten und Modelle genau quantifiziert werden.",
    "Category": ""
  },
  {
    "Id": 45,
    "Front": "Schutzgüter der Informationssicherheit",
    "Back": "Vertraulichkeit: Sicherstellen, dass Informationen nur von autorisierten Personen zugänglich sind. - Integrität: Gewährleisten, dass Informationen unverändert und korrekt bleiben. - Verfügbarkeit: Sicherstellen, dass Informationen bei Bedarf zugänglich und nutzbar sind. /Confidentiality/IntegrityAvailability",
    "Category": ""
  },
  {
    "Id": 46,
    "Front": "Social Engineering",
    "Back": "Social Engineering ist eine Manipulationstechnik, bei der Angreifer psychologische Tricks einsetzen, um vertrauliche Informationen oder Zugang zu Systemen zu erlangen. Anstatt technische Schwachstellen auszunutzen, wird das Vertrauen der Zielperson missbraucht, etwa durch Täuschung oder den Aufbau einer falschen Beziehung. Beispiele sind Phishing, Vishing oder Pretexting, bei denen Opfer dazu gebracht werden, sensible Daten wie Passwörter oder Bankinformationen preiszugeben.",
    "Category": "Hacking"
  },
  {
    "Id": 47,
    "Front": "MFA",
    "Back": "MFA (Multi-Factor Authentication) ist eine Sicherheitsmethode, bei der zur Verifizierung der Identität eines Benutzers mehr als ein Authentifizierungsfaktor verwendet wird. Dies erhöht die Sicherheit, da mindestens zwei der folgenden Faktoren erforderlich sind:",
    "Category": "IT-Sicherheit"
  },
  {
    "Id": 48,
    "Front": "A,- B,- C,- Kunden",
    "Back": "A, B, C Kunden ist eine Klassifikation, die häufig im Vertrieb und Marketing verwendet wird, um Kunden basierend auf ihrem Wert für das Unternehmen zu kategorisieren. Diese Einteilung hilft dabei, Ressourcen gezielt zu verteilen und strategische Entscheidungen zu treffen.",
    "Category": "Betriebswirtschaft"
  },
  {
    "Id": 49,
    "Front": "Arbeitssektoren",
    "Back": "Arbeitssektoren sind die Hauptbereiche, in die wirtschaftliche Tätigkeiten unterteilt werden. Sie helfen dabei, verschiedene Branchen und Berufe einzuordnen. Die klassische Einteilung besteht aus vier Sektoren: Primärer Sektor (Urproduktion), Sekundärer Sektor (Industrie \u0026 Handwerk), Tertiärer Sektor (Dienstleistungen), Quartärer Sektor (Informationssektor) (moderne Erweiterung)",
    "Category": "Arbeitsrecht"
  },
  {
    "Id": 50,
    "Front": "Systemhaus",
    "Back": "Ein Systemhaus ist ein IT-Dienstleistungsunternehmen, das Unternehmen oder Organisationen ganzheitliche IT-Lösungen anbietet. Es kombiniert Hard- und Software, Dienstleistungen und Beratung zu einer maßgeschneiderten Lösung.",
    "Category": "Allgemeinwissen"
  },
  {
    "Id": 51,
    "Front": "Floating License",
    "Back": "Eine Floating License erlaubt die Nutzung einer Software durch eine begrenzte Anzahl von Nutzern innerhalb eines Netzwerks, jedoch nicht gleichzeitig. Die Lizenz wird von einem zentralen Lizenzserver verwaltet und kann von verschiedenen Geräten genutzt werden, solange die maximale Anzahl aktiver Lizenzen nicht überschritten wird.",
    "Category": "Software-Lizenzierung"
  },
  {
    "Id": 52,
    "Front": "Public Domain Software",
    "Back": "Public Domain Software ist Software, die keinem Urheberrechtsschutz unterliegt und von jedem ohne Einschränkungen genutzt, verändert und verbreitet werden kann. Dies kann entweder durch den Ablauf des Urheberrechts oder durch eine ausdrückliche Erklärung des Urhebers geschehen.",
    "Category": "Software-Lizenzierung / Urheberrecht"
  },
  {
    "Id": 53,
    "Front": "Einzelplatzlizenz",
    "Back": "Eine Einzelplatzlizenz erlaubt die Nutzung einer Software auf genau einem Gerät oder durch eine einzelne Person. Sie ist nicht übertragbar und darf nicht gleichzeitig auf mehreren Geräten verwendet werden.",
    "Category": "Software-Lizenzierung"
  },
  {
    "Id": 54,
    "Front": "Open Source",
    "Back": "Open Source bezeichnet Software, deren Quellcode öffentlich zugänglich ist und von jedem eingesehen, verändert und weiterverbreitet werden kann. Oft unterliegt sie speziellen Open-Source-Lizenzen, die Regeln für die Nutzung und Weitergabe festlegen.",
    "Category": "Software-Entwicklung  Lizenzierung"
  },
  {
    "Id": 55,
    "Front": "Oracle",
    "Back": "Oracle ist ein US-amerikanisches Unternehmen, das für seine Datenbankmanagementsysteme (z. B. Oracle Database) bekannt ist. Neben Datenbanken bietet es auch Cloud-Dienste, Unternehmenssoftware und Hardwarelösungen an.",
    "Category": "Unternehmen / Datenbanken"
  },
  {
    "Id": 56,
    "Front": "Nutzungsbasierte Modelle",
    "Back": "Nutzungsbasierte Modelle berechnen Kosten abhängig von der tatsächlichen Nutzung einer Software oder eines Dienstes, z. B. pro Zugriff, Rechenleistung oder Datenvolumen. Dieses Modell wird häufig bei Cloud-Services und Software-as-a-Service (SaaS) eingesetzt.",
    "Category": "Geschäftsmodelle / Software-Lizenzierung"
  },
  {
    "Id": 57,
    "Front": "Compiler",
    "Back": "Ein Compiler ist ein Programm, das Quellcode aus einer Programmiersprache in eine ausführbare Datei oder Maschinencode übersetzt. Dadurch kann der Code von einem Computer ohne weitere Übersetzung direkt ausgeführt werden.",
    "Category": "Software-Entwicklung / Programmierung"
  },
  {
    "Id": 58,
    "Front": "HMI",
    "Back": " HMI (Human-Machine Interface) bezeichnet die Schnittstelle, über die Menschen mit Maschinen oder Systemen interagieren. Sie ermöglicht es Nutzern, Daten einzugeben, den Zustand der Maschine zu überwachen und Befehle zu erteilen, oft in Form von Touchscreens, Tasten oder visuellen Anzeigen.",
    "Category": "Technologie / Benutzerinteraktion"
  },
  {
    "Id": 59,
    "Front": "Schnittstellen",
    "Back": "APIs (Application Programming Interfaces), Benutzerschnittstellen (UI), Hardware-Schnittstellen,Netzwerkschnittstellen - Schnittstellen (APIs) sind definierte Kommunikationswege, über die verschiedene Softwareanwendungen miteinander interagieren können. Sie ermöglichen den Austausch von Daten und Funktionen zwischen Programmen, ohne dass deren interne Struktur offengelegt wird.",
    "Category": "Software / Technologie"
  },
  {
    "Id": 60,
    "Front": "Amortisieren",
    "Back": "Amortisieren bedeutet, die Kosten einer Investition über einen bestimmten Zeitraum hinweg abzuzahlen. Dies geschieht durch regelmäßige Zahlungen, die sowohl Zinsen als auch einen Teil des ursprünglichen Betrags abdecken, bis die Investition vollständig ausgeglichen ist.",
    "Category": "Finanzwesen / Wirtschaft"
  },
  {
    "Id": 61,
    "Front": "Embedded Systems",
    "Back": "Embedded Systems sind spezialisierte, in andere Geräte integrierte Computersysteme, die eine spezifische Funktion erfüllen. Sie sind in der Regel ressourcenoptimiert, zuverlässig und haben oft eine Echtzeitfähigkeit, wie z. B. in Fahrzeugen, Haushaltsgeräten oder Medizingeräten.",
    "Category": "Technologie / Hardware"
  },
  {
    "Id": 62,
    "Front": "AddOn/Plugin",
    "Back": "Ein AddOn oder Plugin ist eine Software-Erweiterung, die zusätzliche Funktionen zu einer bestehenden Anwendung hinzufügt. Es wird oft verwendet, um die Funktionalität von Programmen wie Webbrowsern, Texteditoren oder CMS-Systemen zu erweitern, ohne die Hauptanwendung selbst zu verändern.",
    "Category": "Software / Erweiterungen"
  },
  {
    "Id": 63,
    "Front": "Requirements engeneering",
    "Back": "Requirements Engineering ist der Prozess, bei dem die Anforderungen an ein System oder eine Software gesammelt, dokumentiert und analysiert werden. Ziel ist es, die Bedürfnisse und Erwartungen der Stakeholder klar zu definieren und als Grundlage für die Entwicklung zu nutzen.",
    "Category": "Softwareentwicklung / Projektmanagement"
  },
  {
    "Id": 64,
    "Front": "TCP/UDP",
    "Back": "TCP (Transmission Control Protocol) und UDP (User Datagram Protocol) sind zwei Protokolle zur Übertragung von Daten im Internet. TCP gewährleistet eine zuverlässige, fehlerfreie und in der richtigen Reihenfolge erfolgende Datenübertragung, während UDP schneller ist, aber keine Garantie für die Zustellung oder Reihenfolge bietet.",
    "Category": "Netzwerktechnologien"
  },
  {
    "Id": 65,
    "Front": "Rahmenverträge",
    "Back": "Rahmenverträge sind langfristige Vereinbarungen zwischen zwei Parteien, die die allgemeinen Bedingungen für zukünftige Einzelgeschäfte festlegen. Sie bieten Flexibilität und Klarheit, indem sie Preise, Lieferbedingungen und andere wesentliche Punkte für wiederkehrende Transaktionen vorab definieren.",
    "Category": "Vertragsrecht / Geschäftsbeziehungen"
  },
  {
    "Id": 66,
    "Front": "Server",
    "Back": "Ein Server ist ein Computer oder ein System, das Dienste, Ressourcen oder Daten über ein Netzwerk bereitstellt. Er empfängt Anfragen von Clients (z. B. PCs oder Smartphones) und verarbeitet diese, um Informationen oder Dienste bereitzustellen, wie z. B. Webhosting, Dateispeicherung oder Datenbankverwaltung.",
    "Category": ""
  },
  {
    "Id": 67,
    "Front": "Firmware",
    "Back": "Firmware ist eine spezielle Art von Software, die in Hardwarekomponenten integriert ist und deren Funktionen steuert. Sie ist in der Regel nicht direkt vom Benutzer änderbar und sorgt dafür, dass die Hardware korrekt funktioniert, indem sie grundlegende Anweisungen bereitstellt, wie z. B. beim Booten eines Geräts.",
    "Category": ""
  },
  {
    "Id": 68,
    "Front": "Mainframe-Computer",
    "Back": "Mainframe-Computer sind leistungsstarke Großrechner, die für die Verarbeitung großer Datenmengen und die Ausführung zahlreicher gleichzeitiger Aufgaben in Unternehmen und Institutionen eingesetzt werden. Sie bieten hohe Verfügbarkeit, Sicherheit und Skalierbarkeit und werden häufig für kritische Anwendungen wie Banktransaktionen oder Flugbuchungssysteme genutzt.",
    "Category": ""
  },
  {
    "Id": 69,
    "Front": "WAN",
    "Back": "Ein WAN (Wide Area Network) ist ein Netzwerk, das über große geografische Entfernungen hinweg mehrere lokale Netzwerke (LANs) verbindet. Es ermöglicht die Kommunikation und den Datenaustausch zwischen Standorten, die weit voneinander entfernt sind, z. B. in verschiedenen Städten oder Ländern. Das Internet ist das größte WAN der Welt.",
    "Category": ""
  },
  {
    "Id": 70,
    "Front": "WLAN",
    "Back": "Wireless Local Area Network ist ein drahtloses Netzwerk, das es Geräten ermöglicht, sich innerhalb eines begrenzten geografischen Bereichs, wie z. B. einem Büro oder einem Zuhause, ohne Kabelverbindung zu verbinden. Es nutzt Funktechnologie, um Daten über Funkwellen zu übertragen und bietet eine flexible Verbindung für mobile Geräte.",
    "Category": ""
  },
  {
    "Id": 71,
    "Front": "Cloud",
    "Back": "Die Cloud bezeichnet eine Reihe von Online-Diensten, die über das Internet bereitgestellt werden, anstatt lokal auf einem Computer oder Server installiert zu sein. Cloud-Dienste umfassen Speicher, Anwendungen und Rechenleistung und ermöglichen Benutzern den Zugriff auf Ressourcen von überall aus, solange eine Internetverbindung besteht. Beispiele sind Google Drive, Amazon Web Services (AWS) und Microsoft Azure.",
    "Category": ""
  },
  {
    "Id": 72,
    "Front": "Proprietäre Software",
    "Back": "Proprietäre Software ist Software, deren Quellcode und Lizenzrechte im Besitz eines Unternehmens oder einer Einzelperson sind. Sie darf in der Regel nicht verändert, weitergegeben oder kopiert werden, ohne dass der Rechteinhaber zustimmt. Beispiele für proprietäre Software sind Microsoft Windows, Adobe Photoshop oder Apple macOS. Benutzer zahlen in der Regel für Lizenzen oder Abonnements, um die Software zu nutzen.",
    "Category": ""
  },
  {
    "Id": 73,
    "Front": "Betriebsrat",
    "Back": "Der Betriebsrat vertritt die Interessen der Arbeitnehmer im Unternehmen und sorgt dafür, dass die Rechte der Beschäftigten gewahrt bleiben. In Bezug auf Auszubildende spielt der Betriebsrat eine Rolle, indem er z. B. bei der Ausgestaltung von Arbeitsbedingungen oder bei Beschwerden zu Rate gezogen wird.",
    "Category": "Arbeitsrecht"
  },
  {
    "Id": 74,
    "Front": "Jugendarbeitschutzgesetz",
    "Back": "Das Gesetz schützt jugendliche Auszubildende vor übermäßiger Belastung und regelt ihre Arbeitszeiten, Pausen und den Umfang der Arbeiten. So dürfen Jugendliche z. B. nicht länger als 8 Stunden täglich arbeiten und nicht nach 20 Uhr. Dies stellt sicher, dass die Ausbildung nicht zu einer gesundheitlichen Belastung wird.",
    "Category": "Arbeitsrecht"
  },
  {
    "Id": 75,
    "Front": "Tarifvertrag",
    "Back": "Ein Tarifvertrag regelt die Arbeitsbedingungen für eine bestimmte Branche oder Berufsgruppe und wird zwischen Arbeitgebern und Gewerkschaften ausgehandelt. In vielen Fällen legen Tarifverträge Mindestvergütungen, Arbeitszeiten und Urlaubstage für Auszubildende fest.",
    "Category": "Arbeitsrecht Tarife"
  },
  {
    "Id": 76,
    "Front": "Linienorganisation",
    "Back": "Die Linienorganisation beschreibt eine Form der Hierarchischen Organisation, bei der die Befehls- und Kommunikationswege von oben nach unten verlaufen. Ein häufig verwendetes Schaubild, um eine Linienorganisation darzustellen, ist tatsächlich das Stammbaum-Schaubild. Hier werden die verschiedenen Positionen (wie ein Stammbaum) so dargestellt, dass die Über- und Unterordnung sichtbar ist. n einer Linienorganisation hat jede Position genau einen Vorgesetzten (in vertikaler Linie), was klare Befehlsketten schafft.",
    "Category": "Unternehmensstrukturen"
  },
  {
    "Id": 77,
    "Front": "Aufbauorganisation",
    "Back": "Pyramidenschaubild. Die Aufbauorganisation eines Unternehmens beschreibt die Struktur und Hierarchie innerhalb des Betriebs. Es wird festgelegt, wer wem unterstellt ist und welche Zuständigkeiten es gibt. Im Kontext des Ausbildungsverhältnisses ist es wichtig, dass der Ausbilder klar definiert ist und der Azubi weiß, wer die Ansprechpartner sind.",
    "Category": "Unternehmensstrukturen"
  },
  {
    "Id": 78,
    "Front": "Matrix",
    "Back": "In der IT bezeichnet eine Matrix eine zweidimensionale Datenstruktur, die aus Zeilen und Spalten besteht und häufig in der linearen Algebra, Grafikanwendungen und Machine Learning genutzt wird. In der Computergrafik werden Matrizen verwendet, um Transformationen wie Skalierung, Rotation oder Translation von Objekten im Raum effizient zu berechnen. Auch in neuronalen Netzwerken spielen Matrizen eine zentrale Rolle, da sie die Gewichte und Aktivierungen zwischen den verschiedenen Schichten eines Modells speichern und verarbeiten.",
    "Category": "Datenstrukturen \u0026 Algorithmen"
  },
  {
    "Id": 79,
    "Front": "RACI-Matrix",
    "Back": "Die RACI-Matrix ist ein Modell zur Verantwortlichkeitsverteilung in IT-Projekten und Prozessen, das die Rollen und Zuständigkeiten verschiedener Teammitglieder klar definiert. Sie besteht aus den vier Rollen Responsible (verantwortlich für die Umsetzung), Accountable (endgültig verantwortlich für das Ergebnis), Consulted (beratend involviert) und Informed (über Fortschritt informiert). In IT-Projekten wird die RACI-Matrix genutzt, um Missverständnisse zu vermeiden, die Kommunikation zu verbessern und sicherzustellen, dass alle Beteiligten ihre Aufgaben und Verantwortlichkeiten genau kennen.",
    "Category": "Projektmanagement \u0026 IT-Governance"
  },
  {
    "Id": 80,
    "Front": "Organigramm",
    "Back": "Ein Organigramm ist eine grafische Darstellung der Hierarchie und Struktur einer Organisation, die zeigt, wie Abteilungen, Teams und einzelne Positionen miteinander verknüpft sind. Es wird häufig genutzt, um Verantwortlichkeiten, Kommunikationswege und Entscheidungsbefugnisse innerhalb eines Unternehmens oder einer Behörde klar zu definieren. In der IT wird ein Organigramm beispielsweise eingesetzt, um Rollen wie IT-Administration, Softwareentwicklung, Support und IT-Sicherheit übersichtlich darzustellen und deren Zusammenarbeit zu optimieren.",
    "Category": "Organisationsstruktur \u0026 Unternehmensführung"
  },
  {
    "Id": 81,
    "Front": "Full-Stack-Entwickler",
    "Back": "Ein Full-Stack-Entwickler ist ein Programmierer, der sowohl die Frontend- als auch die Backend-Entwicklung beherrscht und in der Lage ist, eine komplette Anwendung von der Benutzeroberfläche bis zur Server-Logik zu erstellen. Er arbeitet mit verschiedenen Technologien wie HTML, CSS und JavaScript für das Frontend sowie mit Datenbanken, Servern und APIs für das Backend. Durch sein breites Wissen kann ein Full-Stack-Entwickler flexibel in unterschiedlichen Bereichen eingesetzt werden und übernimmt oft eine zentrale Rolle in der Entwicklung von Web- und Softwareprojekten.",
    "Category": "Softwareentwicklung \u0026 Webentwicklung"
  },
  {
    "Id": 82,
    "Front": "Frontend",
    "Back": "Das Frontend bezeichnet den Teil einer Anwendung, der für den Benutzer sichtbar und direkt interaktiv ist, beispielsweise eine Website oder eine App-Oberfläche. Es wird mit Technologien wie HTML, CSS und JavaScript umgesetzt, oft unter Verwendung von Frameworks wie React, Angular oder Vue.js, um komplexe und dynamische Benutzeroberflächen zu erstellen. Ein gutes Frontend zeichnet sich durch ansprechendes Design, intuitive Benutzerführung und eine hohe Performance aus, um eine optimale User Experience zu gewährleisten.",
    "Category": "Webentwicklung \u0026 UI/UX-Design"
  },
  {
    "Id": 83,
    "Front": "Backend",
    "Back": "Das Backend ist der Teil einer Anwendung, der auf dem Server läuft und die Geschäftslogik, Datenverarbeitung sowie die Kommunikation mit der Datenbank verwaltet. Es wird mit Programmiersprachen wie Python, Java, Node.js oder PHP entwickelt und nutzt oft Frameworks wie Django, Spring Boot oder Express.js, um robuste und skalierbare Anwendungen zu erstellen. Ein effizientes Backend sorgt für die sichere Verarbeitung von Benutzeranfragen, die Authentifizierung sowie die Bereitstellung und Verwaltung von Daten über APIs.",
    "Category": "Softwareentwicklung \u0026 Servertechnologien"
  },
  {
    "Id": 84,
    "Front": "CMS",
    "Back": "Ein Content Management System (CMS) ist eine Software, die es Benutzern ermöglicht, digitale Inhalte wie Texte, Bilder und Videos auf einer Website zu erstellen, zu verwalten und zu bearbeiten, ohne tiefgehende Programmierkenntnisse zu benötigen. CMS-Plattformen wie WordPress, Joomla oder Drupal bieten benutzerfreundliche Schnittstellen und eine Vielzahl von Erweiterungen, die die Anpassung von Websites erleichtern. Sie sind besonders nützlich für die Verwaltung von dynamischen Webseiten, Blogs oder E-Commerce-Plattformen und ermöglichen eine effiziente Zusammenarbeit im Team.",
    "Category": "Webentwicklung \u0026 Content Management"
  },
  {
    "Id": 85,
    "Front": "Add-On",
    "Back": "Ein Add-On ist eine Software-Erweiterung, die zusätzliche Funktionen zu einer bestehenden Anwendung oder Plattform hinzufügt, ohne deren Grundstruktur zu verändern. In der IT wird der Begriff oft verwendet, um Plugins, Module oder Erweiterungen zu beschreiben, die bestehende Programme wie Webbrowser, Content-Management-Systeme oder Spiele erweitern, um neue Features bereitzustellen. Add-Ons ermöglichen es Entwicklern und Benutzern, Software flexibel anzupassen und um zusätzliche Funktionen wie z. B. neue Designoptionen, Integrationen oder Sicherheitsfunktionen zu ergänzen.",
    "Category": "Software \u0026 Erweiterungen"
  },
  {
    "Id": 86,
    "Front": "Asset Tracking",
    "Back": "Asset Tracking bezeichnet die Methode zur Verfolgung und Verwaltung von Vermögenswerten (Assets), wie z. B. Hardware, Maschinen oder Ausrüstungen, in einem Unternehmen. Durch den Einsatz von Technologien wie RFID, GPS und Barcode-Scannern können Unternehmen den Standort, den Zustand und den Nutzungshistorie ihrer Assets überwachen, um eine effiziente Verwaltung, Wartung und Kontrolle zu gewährleisten. Diese Praxis ist besonders in der IT und Logistik wichtig, um Verluste zu minimieren, Wartungskosten zu senken und eine präzise Bestandsführung zu ermöglichen.",
    "Category": " IT-Management \u0026 Logistik"
  },
  {
    "Id": 87,
    "Front": "Lean Six Sigma",
    "Back": "Lean Six Sigma ist eine Methodologie zur Verbesserung von Geschäftsprozessen, die Elemente der Lean-Philosophie (Reduzierung von Verschwendung) und des Six Sigma-Ansatzes (Minimierung von Fehlern und Variabilität) kombiniert. Ziel ist es, Prozesse effizienter zu gestalten, Kosten zu senken und die Qualität zu steigern, indem sowohl unnötige Schritte eliminiert als auch die Variabilität in Prozessen reduziert wird. In der IT und anderen Branchen wird Lean Six Sigma genutzt, um Prozesse zu optimieren, Ressourcen besser zu nutzen und eine hohe Kundenzufriedenheit durch kontinuierliche Verbesserung zu gewährleisten.",
    "Category": "Prozessoptimierung \u0026 Qualitätsmanagement"
  },
  {
    "Id": 88,
    "Front": "DMAIC",
    "Back": "DMAIC ist eine systematische Methodik im Rahmen von Six Sigma zur Verbesserung von Prozessen, die aus den fünf Phasen Define (Definieren), Measure (Messen), Analyze (Analysieren), Improve (Verbessern) und Control (Steuern) besteht. Ziel von DMAIC ist es, bestehende Prozesse zu optimieren, indem Probleme identifiziert, die Ursachen analysiert und Lösungen implementiert werden, um die Prozessleistung zu steigern und Variabilität zu verringern. Diese Methode wird häufig in der IT und im produzierenden Gewerbe eingesetzt, um die Qualität und Effizienz von Prozessen nachhaltig zu erhöhen.",
    "Category": "Qualitätsmanagement \u0026 Prozessverbesserung"
  },
  {
    "Id": 89,
    "Front": "Aufgabenanalyse",
    "Back": "Die Aufgabenanalyse ist ein methodischer Prozess, bei dem eine bestimmte Aufgabe oder ein Arbeitsprozess detailliert untersucht wird, um die einzelnen Schritte, Anforderungen und Ressourcen zu identifizieren. Ziel ist es, die Aufgabenstruktur zu verstehen, Optimierungspotentiale zu erkennen und eine effiziente Arbeitsweise zu entwickeln. In der IT wird eine Aufgabenanalyse häufig verwendet, um komplexe Projekte in kleinere, handhabbare Arbeitseinheiten zu unterteilen, die dann leichter zu planen und zu steuern sind. Sie ist auch ein nützliches Werkzeug für die Anforderungsanalyse bei Softwareentwicklungsprojekten",
    "Category": "Projektmanagement \u0026 Arbeitsorganisation"
  },
  {
    "Id": 90,
    "Front": "Aufgabensynthese",
    "Back": "Die Aufgabensynthese ist der Prozess, bei dem verschiedene Teilaufgaben oder Arbeitsprozesse zu einer Gesamtaufgabe zusammengeführt werden. Ziel ist es, diese Aufgaben in einer logischen und effizienten Weise zu kombinieren, um die Gesamtzielsetzung des Projekts oder der Organisation zu erreichen. In der IT wird Aufgabensynthese oft genutzt, um komplexe Projekte in überschaubare, aber miteinander verknüpfte Module zu integrieren, was zu einer besseren Koordination und Ressourcenallokation führt. Sie hilft dabei, die Aufgaben sinnvoll zu gruppieren und redundante oder ineffiziente Schritte zu eliminieren.",
    "Category": "Projektmanagement \u0026 Arbeitsorganisation"
  },
  {
    "Id": 91,
    "Front": "5 Why-Methode",
    "Back": "Die 5 Why-Methode ist eine einfache und effektive Technik zur Ursachenanalyse, bei der man fünfmal hintereinander die Frage \u0022Warum?\u0022 stellt, um die zugrunde liegende Ursache eines Problems zu identifizieren. Durch das wiederholte Hinterfragen werden nicht nur Symptome aufgedeckt, sondern die tatsächliche Ursache des Problems, die oft tiefer in den Prozessen oder Systemen liegt, herausgearbeitet. Diese Methode wird besonders in der IT und im Qualitätsmanagement eingesetzt, um Fehlerursachen zu ermitteln, Prozesse zu verbessern und wiederkehrende Probleme nachhaltig zu lösen.",
    "Category": "Qualitätsmanagement \u0026 Problemlösung"
  },
  {
    "Id": 92,
    "Front": "Zins-Bindung",
    "Back": "Zins-Bindung bezeichnet den Zeitraum, in dem der Zinssatz für ein Darlehen oder eine Finanzierung festgelegt und unveränderlich bleibt. Diese Bindung sorgt für Planungssicherheit, da der Kreditnehmer während der Bindungsfrist keine Zinsschwankungen befürchten muss. I",
    "Category": "Finanzen \u0026 Unternehmensmanagement"
  },
  {
    "Id": 93,
    "Front": "Leitzins",
    "Back": "Der Leitzins ist der Zinssatz, den eine Zentralbank für die Kreditvergabe an Geschäftsbanken festlegt. Dieser Zinssatz beeinflusst maßgeblich die allgemeine Zinslandschaft in einer Volkswirtschaft, da Geschäftsbanken ihre Kredite und Einlagen in der Regel an den Leitzins anpassen. Der Leitzins wird von Zentralbanken wie der Europäischen Zentralbank (EZB) oder der US-Notenbank (Fed) genutzt, um geldpolitische Ziele wie Inflation und Wirtschaftswachstum zu steuern. In der IT-Branche kann der Leitzins indirekt die Kosten für Unternehmensfinanzierungen oder Investitionen in Technologieprojekte beeinflussen.",
    "Category": "Finanzen \u0026 Wirtschaft"
  },
  {
    "Id": 94,
    "Front": "TOM",
    "Back": "Technische und Organisatorische Maßnahmen (TOM) sind Schutzmaßnahmen, die Unternehmen ergreifen müssen, um personenbezogene Daten gemäß der Datenschutz-Grundverordnung (DSGVO) zu sichern. Diese Maßnahmen sollen sicherstellen, dass Daten vor unbefugtem Zugriff, Verlust oder Manipulation geschützt sind.",
    "Category": "IT-Sicherheit \u0026 Datenschutz"
  },
  {
    "Id": 95,
    "Front": "Security vs. Safety",
    "Back": "Security und Safety sind zwei Begriffe, die oft verwechselt werden, jedoch unterschiedliche Bedeutungen haben, insbesondere im IT-Bereich. Security beschreibt den Schutz von IT-Systemen, Netzwerken und Daten vor äußeren Bedrohungen wie Hackerangriffen, Schadsoftware oder unbefugtem Zugriff. Unternehmen setzen hier auf Maßnahmen wie Verschlüsselung, Firewalls und Zugriffskontrollen, um sensible Informationen vor Manipulation oder Diebstahl zu schützen.",
    "Category": " IT-Sicherheit \u0026 Risikomanagement"
  },
  {
    "Id": 96,
    "Front": "Version vs. Variante ",
    "Back": "Die Begriffe Version und Variante klingen ähnlich, beschreiben jedoch unterschiedliche Konzepte in der Softwareentwicklung. Eine Version bezeichnet eine Weiterentwicklung oder Aktualisierung eines bestehenden Softwareprodukts. Sie entsteht durch Fehlerkorrekturen, Leistungsverbesserungen oder neue Funktionen und wird meist mit einer Versionsnummer gekennzeichnet, beispielsweise 2.0 oder 3.1. Updates innerhalb einer Version können kleinere Änderungen beinhalten, während ein großer Versionssprung oft tiefgreifende Neuerungen mit sich bringt.",
    "Category": "Softwareentwicklung \u0026 Produktmanagement"
  },
  {
    "Id": 97,
    "Front": "IaaS, SaaS, ScaaS, WaaS, DaaS, PaaS",
    "Back": "Cloud Computing bietet verschiedene Dienstmodelle, die sich in ihrem Leistungsumfang unterscheiden. Infrastructure as a Service (IaaS) stellt virtuelle Server, Netzwerke und Speicherressourcen bereit, auf denen Unternehmen ihre eigenen Anwendungen betreiben können, ohne physische Hardware verwalten zu müssen. Platform as a Service (PaaS) bietet eine Entwicklungsumgebung, in der Entwickler Anwendungen erstellen, testen und ausführen können, ohne sich um die zugrunde liegende Infrastruktur kümmern zu müssen. Software as a Service (SaaS) hingegen stellt vollständige Softwarelösungen über das Internet bereit, sodass Nutzer Programme direkt im Browser verwenden können, ohne Installation oder Wartung.",
    "Category": "Cloud Computing \u0026 IT-Dienste"
  },
  {
    "Id": 98,
    "Front": "On-Premise ",
    "Back": "On-Premise bezeichnet eine IT-Betriebsform, bei der Software, Server und Datenbanken vollständig innerhalb der eigenen Unternehmensinfrastruktur gehostet und betrieben werden. Im Gegensatz zu Cloud-Lösungen liegen alle Systeme und Daten auf firmeneigenen Servern, die entweder im eigenen Rechenzentrum oder in speziell gesicherten Räumen innerhalb des Unternehmens untergebracht sind. Dadurch behalten Unternehmen die volle Kontrolle über ihre IT-Umgebung, müssen aber auch für Wartung, Updates, Sicherheit und Skalierung selbst sorgen.",
    "Category": "IT-Infrastruktur \u0026 Deployment"
  },
  {
    "Id": 99,
    "Front": "Server-Arten",
    "Back": "Server übernehmen in der IT verschiedene Aufgaben und lassen sich nach ihrem Einsatzzweck in unterschiedliche Kategorien unterteilen. Ein Webserver stellt Webseiten und Webanwendungen bereit und verarbeitet Anfragen von Clients über das HTTP-Protokoll. Ein Datenbankserver speichert, verwaltet und stellt strukturierte Daten für Anwendungen bereit, sodass mehrere Nutzer oder Systeme gleichzeitig darauf zugreifen können. Ein Mailserver ermöglicht das Senden, Empfangen und Verwalten von E-Mails, indem er Nachrichten zwischen Clients und anderen Mailservern weiterleitet.",
    "Category": "IT-Infrastruktur \u0026 Netzwerke"
  },
  {
    "Id": 100,
    "Front": "DMZ",
    "Back": "Die Demilitarisierte Zone (DMZ) ist ein speziell abgesicherter Bereich in einem Computernetzwerk, der zwischen dem internen Unternehmensnetzwerk und dem öffentlichen Internet liegt. Sie dient dazu, externe Dienste wie Webserver, Mailserver oder VPN-Gateways bereitzustellen, ohne dabei das interne Netzwerk direkt Angriffen aus dem Internet auszusetzen. Die DMZ wird durch eine Firewall-Architektur geschützt, die den Datenverkehr zwischen der DMZ, dem internen Netzwerk und dem Internet gezielt kontrolliert.",
    "Category": "Netzwerksicherheit \u0026 IT-Infrastruktur"
  },
  {
    "Id": 101,
    "Front": "KVP",
    "Back": "Der Kontinuierliche Verbesserungsprozess (KVP) ist eine Methode zur stetigen Optimierung von Prozessen, Produkten oder Dienstleistungen innerhalb eines Unternehmens. Anstatt auf einmalige große Veränderungen zu setzen, basiert KVP auf kleinen, schrittweisen Verbesserungen, die regelmäßig umgesetzt und überprüft werden. Dabei werden häufig Ansätze wie das PDCA-Modell (Plan-Do-Check-Act) oder die Kaizen-Philosophie verwendet, um eine nachhaltige und langfristige Weiterentwicklung sicherzustellen.",
    "Category": "Qualitätsmanagement \u0026 Prozessoptimierung"
  }
]