[
  {
    "Id": 1,
    "Front": "AVV",
    "Back": "Allgemeine Verwaltungsvorschrift.",
    "Category": "Mathematik"
  },
  {
    "Id": 2,
    "Front": "DSGVO Grundsätze",
    "Back": "Rechtmäßigkeit, Zweckbindung, Datenminimierung, Richtigkeit der Daten, Speicherbegrenzung, Integrität und Vertraulichkeit, Rechenschaftspflicht, ",
    "Category": "Rechtswissen DSGVO"
  },
  {
    "Id": 3,
    "Front": "Leasingvertrag",
    "Back": "Mietähnlicher Vertrag über die Nutzung eines Wirtschaftsguts gegen regelmäßige Zahlungen. Eigentum bleibt beim Leasinggeber.",
    "Category": "Vertragsrecht, Finanzwesen"
  },
  {
    "Id": 4,
    "Front": "Fälligkeitsdarlehen",
    "Back": "Darlehen, bei dem die gesamte Rückzahlung erst am Ende der Laufzeit erfolgt. Währenddessen nur Zinszahlungen.",
    "Category": "Finanzwesen"
  },
  {
    "Id": 5,
    "Front": "Vertragsautonomie",
    "Back": "Freiheit der Vertragsparteien, Inhalt, Form und Partner eines Vertrags selbst zu bestimmen. Einschränkungen durch Gesetze möglich.",
    "Category": "Rechtswissen"
  },
  {
    "Id": 6,
    "Front": "Instandhaltungspflicht",
    "Back": "Verpflichtung, eine Sache in gebrauchsfähigem Zustand zu erhalten. Trägt meist der Eigentümer oder Vermieter.",
    "Category": "Rechtswissen"
  },
  {
    "Id": 7,
    "Front": "Subventionen",
    "Back": "Subventionen sind finanzielle Zuschüsse oder Unterstützungszahlungen, die von Regierungen oder öffentlichen Institutionen an Unternehmen, Organisationen oder Einzelpersonen gewährt werden. Ziel ist es, bestimmte wirtschaftliche Aktivitäten zu fördern, wie etwa die Produktion von Gütern oder Dienstleistungen, die von gesellschaftlichem Interesse sind. Subventionen können in Form von direkten Zahlungen, Steuererleichterungen oder zinsgünstigen Krediten gewährt werden. Sie werden oft genutzt, um die Preise für Verbraucher zu senken, Arbeitsplätze zu schaffen oder umweltfreundliche Technologien zu unterstützen.",
    "Category": "Finanzwesen"
  },
  {
    "Id": 8,
    "Front": "Ratendarlehen",
    "Back": "sind Darlehen, bei denen der Kreditnehmer das geliehene Kapital in regelmäßigen, meist monatlichen Raten zurückzahlt. Jede Rate setzt sich dabei aus einem Zinsanteil und einem Tilgungsanteil zusammen. Zu Beginn sind die Zinsen höher, da sie auf den gesamten Darlehensbetrag berechnet werden, aber mit fortschreitender Rückzahlung sinkt der Zinsanteil und der Tilgungsanteil wird größer. Ratendarlehen sind eine gängige Finanzierungsform für Privatpersonen, zum Beispiel für den Kauf von Autos oder Konsumgütern, aber auch für größere Investitionen.",
    "Category": "Finanzwesen"
  },
  {
    "Id": 9,
    "Front": "Underpinning Contract",
    "Back": "Ein Underpinning Contract ist ein Vertrag, der die Grundlage für eine Hauptvereinbarung bildet und zusätzliche rechtliche Rahmenbedingungen oder Absicherungen für das zugrunde liegende Geschäft festlegt.",
    "Category": "Vertragsrecht"
  },
  {
    "Id": 10,
    "Front": "Intervall",
    "Back": "Ein Intervall ist der Zeitraum oder die Entfernung zwischen zwei Ereignissen oder Punkten. In der Mathematik bezeichnet es einen Abschnitt auf einer Zahlengerade, der durch zwei Grenzwerte begrenzt wird.",
    "Category": "Allgemeinwissen"
  },
  {
    "Id": 11,
    "Front": "Anlagevermögen",
    "Back": "Anlagevermögen umfasst langfristige Vermögenswerte eines Unternehmens, die für die betriebliche Tätigkeit genutzt werden und nicht für den kurzfristigen Verkauf bestimmt sind. Dazu gehören z. B. Grundstücke, Gebäude, Maschinen und Fahrzeuge.",
    "Category": "Finanzwesen"
  },
  {
    "Id": 12,
    "Front": "Unternehmensbilanzen",
    "Back": "Unternehmensbilanzen sind finanzielle Übersichten, die die Vermögens- und Kapitalstruktur eines Unternehmens zu einem bestimmten Zeitpunkt darstellen. Sie setzen sich aus der Aktiva (Vermögenswerte) und der Passiva (Eigen- und Fremdkapital) zusammen und geben Aufschluss über die finanzielle Lage des Unternehmens.",
    "Category": "Finanzwesen"
  },
  {
    "Id": 13,
    "Front": "File.Exists()",
    "Back": "Die Methode File.Exists() in C# wird verwendet, um zu überprüfen, ob eine Datei im angegebenen Pfad existiert. Sie gibt einen booleschen Wert zurück-",
    "Category": "Coding Csharp"
  },
  {
    "Id": 14,
    "Front": "XAML",
    "Back": "XAML steht für Extensible Application Markup Language und ist eine deklarative Markup-Sprache, die verwendet wird, um Benutzeroberflächen zu erstellen. Sie wird hauptsächlich in .NET-Technologien wie WPF, UWP und Xamarin eingesetzt. Mit XAML definieren Entwickler das Layout und die Struktur einer Anwendung, während die Logik normalerweise in einer Programmiersprache wie C# geschrieben wird.",
    "Category": "Coding Csharp"
  },
  {
    "Id": 15,
    "Front": "WPF",
    "Back": "WPF, was für Windows Presentation Foundation steht, ist ein UI-Framework von Microsoft, das für die Entwicklung von Desktop-Anwendungen unter Windows verwendet wird. Es bietet eine leistungsstarke Umgebung zur Erstellung grafisch anspruchsvoller Benutzeroberflächen, einschließlich 2D- und 3D-Grafiken sowie Animationen und Datenbindung. WPF nutzt XAML für das Design und C# für die Anwendungslogik.",
    "Category": "Coding Csharp"
  },
  {
    "Id": 16,
    "Front": "UWP",
    "Back": "die Universal Windows Platform, ist eine Plattform von Microsoft, die es Entwicklern ermöglicht, Anwendungen zu erstellen, die auf allen Windows 10 Geräten laufen, wie PCs, Tablets, Smartphones und sogar Xbox. UWP verwendet ebenfalls XAML für das UI-Design und ermöglicht den Zugriff auf moderne Windows 10 Funktionen wie Cortana und Live-Tiles, während die Apps im Microsoft Store bereitgestellt werden.",
    "Category": "Coding Csharp"
  },
  {
    "Id": 17,
    "Front": "XAML",
    "Back": "XAML steht für Extensible Application Markup Language und ist eine deklarative Markup-Sprache, die verwendet wird, um Benutzeroberflächen zu erstellen. Sie wird hauptsächlich in .NET-Technologien wie WPF, UWP und Xamarin eingesetzt. Mit XAML definieren Entwickler das Layout und die Struktur einer Anwendung, während die Logik normalerweise in einer Programmiersprache wie C# geschrieben wird.",
    "Category": "Coding Csharp"
  },
  {
    "Id": 18,
    "Front": "test",
    "Back": "ye",
    "Category": "wer"
  },
  {
    "Id": 19,
    "Front": "new card ",
    "Back": "yo",
    "Category": "xoxo"
  },
  {
    "Id": 20,
    "Front": "Maschinencode",
    "Back": "Maschinencode ist die direkt von der CPU ausführbare Form eines Programms. Er besteht aus binären Anweisungen (0 und 1), die spezifische Operationen wie Rechnen, Speichern oder Vergleichen steuern. Da Maschinencode schwer zu lesen und zu schreiben ist, wird er meist durch höhere Programmiersprachen erstellt und dann von einem Compiler in Maschinencode übersetzt.",
    "Category": "Allgemeinwissen"
  },
  {
    "Id": 21,
    "Front": "GPL ",
    "Back": "GPL (GNU General Public License) ist eine Open-Source-Lizenz, die von der Free Software Foundation entwickelt wurde. Sie erlaubt die freie Nutzung, Veränderung und Weitergabe von Software, solange der Quellcode offen bleibt und Änderungen ebenfalls unter der GPL veröffentlicht werden. Dies fördert Transparenz, Zusammenarbeit und verhindert proprietäre Nutzung ohne Freigabe des Codes.",
    "Category": "Informatik"
  },
  {
    "Id": 22,
    "Front": "MIT-Lizenz",
    "Back": "MIT-Lizenz ist eine sehr permissive Open-Source-Lizenz, die es erlaubt, Software frei zu nutzen, zu verändern und zu verbreiten, auch für kommerzielle Zwecke. Die einzige Bedingung ist, dass der ursprüngliche Lizenztext erhalten bleibt. Sie bietet Entwicklern maximale Freiheit und wird oft in Open-Source-Projekten verwendet.",
    "Category": "Informatik"
  },
  {
    "Id": 23,
    "Front": "ITIL",
    "Back": "ITIL (Information Technology Infrastructure Library) ist ein Framework für IT-Service-Management (ITSM). Es bietet Best Practices zur Planung, Bereitstellung und Verwaltung von IT-Diensten, um Geschäftsprozesse effizient zu unterstützen. ITIL hilft Unternehmen, ihre IT-Services kundenorientiert und wirtschaftlich zu optimieren.",
    "Category": "Frameworks "
  },
  {
    "Id": 24,
    "Front": "Design Patterns",
    "Back": "Entwurfsmuster (Design Patterns) sind bewährte Lösungen für wiederkehrende Probleme in der Softwareentwicklung. Sie bieten strukturierte Ansätze zur Verbesserung von Code-Wartbarkeit, Flexibilität und Wiederverwendbarkeit. Bekannte Muster sind z. B. Singleton, Factory und Observer.",
    "Category": "Coding"
  },
  {
    "Id": 25,
    "Front": "SSH",
    "Back": "SSH (Secure Shell) ist ein Netzwerkprotokoll für die sichere Kommunikation zwischen Computern. Es ermöglicht verschlüsselte Verbindungen für Remote-Zugriff, Dateiübertragungen und sichere Befehlsausführung. SSH wird häufig für die Administration von Servern und sicheren Datenaustausch genutzt.",
    "Category": "Netzwerke"
  },
  {
    "Id": 26,
    "Front": "RTU",
    "Back": "RTU (Remote Terminal Unit) ist ein elektronisches Gerät, das in Industrie- und Automatisierungssystemen zur Fernüberwachung und -steuerung eingesetzt wird. Es sammelt Daten von Sensoren, verarbeitet sie und sendet sie an ein zentrales Leitsystem (SCADA). RTUs werden häufig in der Energieversorgung, Wasserwirtschaft und Prozessindustrie genutzt.",
    "Category": "Informatik"
  },
  {
    "Id": 27,
    "Front": "OSI-Model",
    "Back": "Das 7-Schichten-OSI-Modell beschreibt, wie Daten in Netzwerken übertragen werden. Anwendungsschicht (Application Layer), Darstellungsschicht (Presentation Layer), Sitzungsschicht (Session Layer), Transportschicht (Transport Layer),Vermittlungsschicht (Network Layer),Sicherungsschicht (Data Link Layer), Bitübertragungsschicht (Physical Layer)",
    "Category": "Netzwerke"
  },
  {
    "Id": 28,
    "Front": "Encapsulation (Kapselung) in Netzwerken",
    "Back": "Encapsulation (Kapselung) in Netzwerken bezieht sich auf den Prozess, bei dem Daten in verschiedene Schichten eines Netzwerkprotokolls verpackt werden. Jede Schicht fügt der ursprünglichen Nachricht ihre eigene Informationsheader hinzu, um die Kommunikation und Übertragung zu steuern. Beim Senden von Daten durch ein Netzwerk werden diese Schichten in der Reihenfolge von der Anwendung bis zur physischen Übertragung hinzugefügt und auf der Empfangsseite wieder \u0022abgewickelt\u0022, wobei die jeweiligen Header entfernt werden. Dieser Prozess gewährleistet eine strukturierte, sichere und effiziente Datenübertragung.",
    "Category": "Netzwerke"
  },
  {
    "Id": 29,
    "Front": "Oszilloskop",
    "Back": "Ein Oszilloskop ist ein elektronisches Messgerät, das die Spannung über die Zeit graphisch darstellt. Es zeigt elektrische Signale als Wellenformen auf einem Bildschirm, sodass Ingenieure und Techniker Signalverläufe, Frequenzen und andere Eigenschaften von elektrischen Schaltungen überwachen können. Oszilloskope werden in der Fehlerdiagnose, Signalverarbeitung und Entwicklung von elektronischen Geräten verwendet.",
    "Category": "Allgemeinwissen"
  },
  {
    "Id": 30,
    "Front": "Operational Level Agreement (OLA)",
    "Back": "Ein Operational Level Agreement (OLA) ist eine Vereinbarung innerhalb eines Unternehmens, die die Serviceleistungen zwischen verschiedenen internen Abteilungen oder Teams regelt. Es beschreibt die spezifischen Leistungen, die ein Team gegenüber einem anderen erbringen muss, und legt die Anforderungen in Bezug auf Qualität, Verfügbarkeit und Reaktionszeiten fest. Im Gegensatz zu einem SLA (Service Level Agreement), das sich auf externe Kunden bezieht, konzentriert sich das OLA auf die internen Abläufe und die Zusammenarbeit zwischen verschiedenen Abteilungen.",
    "Category": "Verträge"
  },
  {
    "Id": 31,
    "Front": "SLA (Service Level Agreement) = Extern: Vereinbarung zwischen einem Unternehmen und externen Dienstleistern oder Kunden.",
    "Back": "Ja, ein Service Level Agreement (SLA) ist oft auch eine Vereinbarung zwischen einem Unternehmen und einem Outsourcer (z. B. einem externen Dienstleister). In diesem Kontext regelt die SLA die spezifischen Leistungen, die der Outsourcer erbringen muss, einschließlich der Qualitätsstandards, Reaktionszeiten, Verfügbarkeiten und anderer Servicekriterien. Es stellt sicher, dass der Outsourcer die vereinbarten Dienstleistungen auf einem akzeptablen Niveau bereitstellt und gibt dem Unternehmen klare Erwartungen an die Zusammenarbeit.",
    "Category": "Vertäge"
  },
  {
    "Id": 32,
    "Front": "Underpinning Contract (UC)",
    "Back": "Ein SLA ist oft Teil des Underpinning Contracts, da es die Servicelevels festlegt, die der Vertragspartner (z. B. ein Outsourcing-Dienstleister) liefern muss.",
    "Category": "Verträge"
  },
  {
    "Id": 33,
    "Front": "Öffnungsklauseln",
    "Back": "Öffnungsklauseln sind vertragliche Bestimmungen, die es den Parteien ermöglichen, bestimmte Vertragsbedingungen während der Laufzeit des Vertrages anzupassen. Diese Klauseln werden oft verwendet, um auf unvorhergesehene Veränderungen in den Umständen zu reagieren, wie z. B. Preisänderungen, Änderungen in gesetzlichen Vorschriften oder Marktbedingungen. Sie bieten Flexibilität, um den Vertrag an veränderte Gegebenheiten anzupassen, ohne dass der gesamte Vertrag neu verhandelt werden muss.",
    "Category": "Verträge"
  },
  {
    "Id": 34,
    "Front": "Rechtsordnung",
    "Back": "Ein Oberbegriff für Strafrecht, Zivilrecht und Öffentliches Recht ist Rechtsordnung oder einfach Recht. Diese drei Bereiche bilden zusammen das gesamte Rechtssystem eines Staates und regeln unterschiedliche Aspekte der rechtlichen Beziehungen und Verantwortlichkeiten innerhalb der Gesellschaft.",
    "Category": "Rechte"
  },
  {
    "Id": 35,
    "Front": "DIN",
    "Back": "DIN (Deutsches Institut für Normung) ist eine Organisation, die in Deutschland Normen und Standards für verschiedene Branchen und Technologien entwickelt. Diese Normen dienen dazu, Qualität, Sicherheit und Effizienz in Produkten, Dienstleistungen und Prozessen zu gewährleisten. DIN-Normen sind in vielen Bereichen wie Maschinenbau, Elektrotechnik, Bauwesen und auch im IT-Bereich weit verbreitet.",
    "Category": "Rechte"
  },
  {
    "Id": 36,
    "Front": "OPC",
    "Back": "Open Platform Communications (OPC), oft auch als OPC Classic bezeichnet, ist ein Kommunikationsstandard, der ursprünglich von Microsoft entwickelt wurde, um den Datenaustausch zwischen verschiedenen Automatisierungs- und Steuerungssystemen in der Industrie zu ermöglichen. Der Standard verwendet COM/DCOM (Component Object Model / Distributed Component Object Model), um eine Plattform-unabhängige Kommunikation zwischen Geräten und Anwendungen sicherzustellen.",
    "Category": "Rechte"
  },
  {
    "Id": 37,
    "Front": "Audit",
    "Back": "Ein Audit ist eine systematische, unabhängige Überprüfung von Prozessen, Systemen oder Finanzunterlagen, um deren Genauigkeit, Wirksamkeit und Übereinstimmung mit festgelegten Standards oder Vorschriften zu bewerten. Audits können in verschiedenen Bereichen durchgeführt werden, wie z. B. im Finanzwesen, der IT-Sicherheit oder der Qualitätssicherung. Ziel ist es, Schwachstellen aufzudecken, die Einhaltung von Vorschriften sicherzustellen und Empfehlungen zur Verbesserung zu geben.",
    "Category": "BWL"
  },
  {
    "Id": 38,
    "Front": "ISO",
    "Back": "ISO (International Organization for Standardization) ist eine internationale Organisation, die weltweit anerkannte Normen für verschiedene Branchen und Sektoren entwickelt. ISO-Normen legen Standards für Qualität, Sicherheit, Effizienz und Nachhaltigkeit fest, um Produkte, Dienstleistungen und Systeme zu harmonisieren und die Zusammenarbeit zwischen Ländern zu fördern. Bekannte ISO-Normen sind zum Beispiel die ISO 9001 für Qualitätsmanagement und die ISO 27001 für Informationssicherheitsmanagement.",
    "Category": "Informatik"
  },
  {
    "Id": 39,
    "Front": "TCO",
    "Back": "TCO (Total Cost of Ownership) bezeichnet die Gesamtkosten, die mit dem Erwerb, Betrieb und der Wartung eines Produkts oder Systems über dessen gesamten Lebenszyklus hinweg verbunden sind. Dies schließt nicht nur den Anschaffungspreis ein, sondern auch Kosten für Installation, Schulung, Wartung, Support, Energieverbrauch und eventuell entstehende Reparaturen. Die TCO-Analyse hilft Unternehmen, eine fundierte Entscheidung über Investitionen zu treffen, indem sie die langfristigen Kosten berücksichtigt.",
    "Category": ""
  },
  {
    "Id": 40,
    "Front": "EU-Ecolabel",
    "Back": "Das EU-Ecolabel ist ein Umweltzeichen der Europäischen Union, das umweltfreundliche Produkte und Dienstleistungen kennzeichnet. Es wird an Produkte verliehen, die hohe Umweltstandards erfüllen und während ihres Lebenszyklus eine geringe Auswirkung auf die Umwelt haben, z. B. in Bezug auf Energieverbrauch, Schadstoffemissionen und Abfallmanagement. Das EU-Ecolabel dient Verbrauchern als Orientierungshilfe, um umweltbewusste Kaufentscheidungen zu treffen und fördert die nachhaltige Entwicklung.",
    "Category": "Allgemeinwissen"
  },
  {
    "Id": 41,
    "Front": "GPP (Green Public Procurement)",
    "Back": "GPP (Green Public Procurement), auf Deutsch Grüne öffentliche Beschaffung, bezeichnet die Praxis, bei der öffentliche Auftraggeber Produkte, Dienstleistungen und Bauprojekte auswählen, die umweltfreundlicher und nachhaltiger sind. Ziel ist es, durch die Berücksichtigung von Umweltkriterien bei der Vergabe von Aufträgen die Umweltauswirkungen zu verringern und zur Förderung einer umweltfreundlicheren Wirtschaft beizutragen. GPP berücksichtigt Faktoren wie Energieeffizienz, Ressourcenschonung und reduzierte Schadstoffemissionen.",
    "Category": "Allgemeinwissen"
  },
  {
    "Id": 42,
    "Front": "Governance",
    "Back": "Governance bezeichnet die Struktur, Prozesse und Prinzipien, durch die Organisationen oder Systeme geführt, kontrolliert und verwaltet werden. Es umfasst die Entscheidungsfindung, Verantwortlichkeiten, Rechenschaftspflicht und die Einhaltung von Vorschriften. In der Unternehmensführung bezieht sich Governance auf die Art und Weise, wie ein Unternehmen oder eine Organisation ihre Ziele erreicht, Risiken managt und die Interessen der Stakeholder berücksichtigt. Gute Governance fördert Transparenz, Effizienz und ethisches Verhalten in allen Bereichen der Organisation.",
    "Category": ""
  },
  {
    "Id": 43,
    "Front": "Compliance",
    "Back": "Compliance bezeichnet die Einhaltung von Gesetzen, Vorschriften, Richtlinien und internen Standards innerhalb einer Organisation. Es umfasst alle Maßnahmen und Verfahren, die sicherstellen, dass ein Unternehmen oder eine Institution rechtlichen und regulatorischen Anforderungen entspricht. Compliance ist in vielen Bereichen wichtig, darunter Finanzen, Datenschutz und Umweltvorschriften, und schützt Unternehmen vor rechtlichen Konsequenzen, Reputationsverlust und anderen Risiken.",
    "Category": ""
  },
  {
    "Id": 44,
    "Front": "GRC ",
    "Back": "GRC (Governance, Risk Management, and Compliance) bezeichnet einen integrierten Ansatz zur Verwaltung von Unternehmensführung, Risikomanagement und Compliance.",
    "Category": ""
  },
  {
    "Id": 45,
    "Front": "Risikoobjektivismus",
    "Back": "Risikoobjektivismus besagt, dass Risiken objektiv messbar und universell definierbar sind, unabhängig von subjektiven Wahrnehmungen. Risiken können durch Daten und Modelle genau quantifiziert werden.",
    "Category": ""
  },
  {
    "Id": 46,
    "Front": "Schutzgüter der Informationssicherheit",
    "Back": "Vertraulichkeit: Sicherstellen, dass Informationen nur von autorisierten Personen zugänglich sind. - Integrität: Gewährleisten, dass Informationen unverändert und korrekt bleiben. - Verfügbarkeit: Sicherstellen, dass Informationen bei Bedarf zugänglich und nutzbar sind. /Confidentiality/IntegrityAvailability",
    "Category": ""
  },
  {
    "Id": 47,
    "Front": "Social Engineering",
    "Back": "Social Engineering ist eine Manipulationstechnik, bei der Angreifer psychologische Tricks einsetzen, um vertrauliche Informationen oder Zugang zu Systemen zu erlangen. Anstatt technische Schwachstellen auszunutzen, wird das Vertrauen der Zielperson missbraucht, etwa durch Täuschung oder den Aufbau einer falschen Beziehung. Beispiele sind Phishing, Vishing oder Pretexting, bei denen Opfer dazu gebracht werden, sensible Daten wie Passwörter oder Bankinformationen preiszugeben.",
    "Category": "Hacking"
  },
  {
    "Id": 48,
    "Front": "MFA",
    "Back": "MFA (Multi-Factor Authentication) ist eine Sicherheitsmethode, bei der zur Verifizierung der Identität eines Benutzers mehr als ein Authentifizierungsfaktor verwendet wird. Dies erhöht die Sicherheit, da mindestens zwei der folgenden Faktoren erforderlich sind:",
    "Category": "IT-Sicherheit"
  },
  {
    "Id": 49,
    "Front": "A,- B,- C,- Kunden",
    "Back": "A, B, C Kunden ist eine Klassifikation, die häufig im Vertrieb und Marketing verwendet wird, um Kunden basierend auf ihrem Wert für das Unternehmen zu kategorisieren. Diese Einteilung hilft dabei, Ressourcen gezielt zu verteilen und strategische Entscheidungen zu treffen.",
    "Category": "Betriebswirtschaft"
  },
  {
    "Id": 50,
    "Front": "Arbeitssektoren",
    "Back": "Arbeitssektoren sind die Hauptbereiche, in die wirtschaftliche Tätigkeiten unterteilt werden. Sie helfen dabei, verschiedene Branchen und Berufe einzuordnen. Die klassische Einteilung besteht aus vier Sektoren: Primärer Sektor (Urproduktion), Sekundärer Sektor (Industrie \u0026 Handwerk), Tertiärer Sektor (Dienstleistungen), Quartärer Sektor (Informationssektor) (moderne Erweiterung)",
    "Category": "Arbeitsrecht"
  },
  {
    "Id": 51,
    "Front": "Systemhaus",
    "Back": "Ein Systemhaus ist ein IT-Dienstleistungsunternehmen, das Unternehmen oder Organisationen ganzheitliche IT-Lösungen anbietet. Es kombiniert Hard- und Software, Dienstleistungen und Beratung zu einer maßgeschneiderten Lösung.",
    "Category": "Allgemeinwissen"
  }
]